# extend list of packages..
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "heroku/brew"
tap "golangci/tap"
tap "goreleaser/tap"
tap "homebrew/autoupdate"

# Linux commands..
brew "curl"
brew "grep"
brew "htop"
brew "jq" # JSON terminal processor

# Programming languages
brew "go"
brew "nvm" # Node version manager
brew "terraform"
brew "vim"

# Graphical applications
cask "discord"
cask "docker"
cask "google-chrome"
cask "notion"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "whatsapp"
cask "imageoptim" # image optimisation
cask "rectangle" # window manager